stream_service/stress.yml
config:
  target: 'http://ec2-13-57-179-177.us-west-1.compute.amazonaws.com:1337'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Sustained max load"
scenarios:
  - name: "Get Chunk Number 23 720p"
    flow:
    - post:
        url: "/startsession"
        json: 
          content_id: "123"
          user_id: "456"
    - get:
        url: "/chunk/somecontent?res=720&chunkNumber=23"
    count: 100

  - name: "Get Chunk Number 23 240p"
    flow:
    - post:
        url: "/startsession"
        json: 
          content_id: "123"
          user_id: "456"
    - get:
        url: "/chunk/somecontent?res=240&chunkNumber=23"
    count: 100